{"page_content": "[{\"level\": 1, \"title\": \" Email Templates \", \"body\": [\"Appwrite uses emails to communicate with users to perform authentication and verification actions. Emails can be customized to fit your app's design and voice.\", \" Each Appwrite project can have its own set of unique templates. Templates also support localization, so every template can be written in multiple languages and served depending on the configured locale.\"]}, {\"level\": 2, \"title\": \"Customize Templates\", \"body\": [\"You can customize email templates for each of your projects in the Appwrite Console. \", \" Custom SMTP Server Required The built-in email service does not support custom email templates to prevent malicious templates. Configure a custom SMTP server to enable custom email templates.\", \" In your project, navigate to the Auth service. Under the Auth service, navigate to the Templates tab. Expand the email template you want to edit. Select the Template language. You can have a different template for each language your app supports. Update the email template fields and click **Update** to save your changes.\"]}, {\"level\": 2, \"title\": \"Email Templates\", \"body\": [\"You can customize the email templates for account verification, magic-url authentication, password resets, and user invites.\"]}, {\"level\": 3, \"title\": \"Email Template Components\", \"body\": [\"Each email templates has the following components that you can customize.\", \"   Component Description     Sender name Readers will see this as a display name of the sender.   Sender email Readers will see this as a display email of the sender. This email must be authenticated on the SMTP provider you've configured, otherwise it will be delivered to the spam folder. This usually means the email must end with the same domain as your SMTP username.   Reply to Readers will reply to this email address instead of the sender address. You can leave this field empty, and the sender email will be used automatically.   Subject The title of the email.   Message The body of the email in HTML format. You can find the variables available in the Email Template Syntax section.  \"]}, {\"level\": 3, \"title\": \"Email Template Syntax\", \"body\": [\"Variables can be used in email templates to dynamically construct unique emails for each reader. These variables can only be used in the Message field of the email template.\", \"   Variable Description     {{project}} The project name.   {{team}} The project team's name.   {{user}} The name of the user receiving the email. This variable is not available in the Magic URL template, as there might not be a user yet.   {{redirect}} The URL for the user to complete the email template's action.  \"]}, {\"level\": 3, \"title\": \"Email Template Examples\", \"body\": [\"Here's an example of using these variables in a template.\", \" <!doctype html>\\n&lthtml>\\n\\n&lthead>\\n    &ltstyle>\\n        ... your style here\\n    </style>\\n</head>\\n\\n&ltbody style=\\\"direction: ltr\\\">\\n\\n&ltdiv style=\\\"max-width:650px; word-wrap: break-word; overflow-wrap: break-word;\\n  word-break: break-all; margin:0 auto;\\\">\\n    &lttable style=\\\"margin-top: 32px\\\">\\n        &lttr>\\n            &lttd>\\n                &lth1>\\n                    {{subject}}\\n                </h1>\\n            </td>\\n        </tr>\\n    </table>\\n\\n    &lttable style=\\\"margin-top: 40px\\\">\\n        &lttr>\\n            &lttd>\\n                &ltp&gtHello </p>\\n\\n                &ltp&gtFollow this link to reset your {{project}} password.</p>\\n\\n                &lta href=\\\"{{redirect}}\\\" target=\\\"_blank\\\">{{redirect}}</a>\\n\\n                &ltp>&ltbr /&gtIf you didn't ask to reset your password, you can ignore this message.</p>\\n                &ltbr />\\n\\n                &ltp&gtThanks\\n                &ltbr />\\n                {{project}} team\\n                </p>\\n            </td>\\n        </tr>\\n    </table>\\n</div>\\n\\n</body>\\n\\n</html>\"]}]", "metadata": {"source": "http://167.172.175.165:2080/docs/email-and-sms-templates"}}