{"page_content": "[{\"level\": 1, \"title\": \" Response Codes \", \"body\": [\"Appwrite uses conventional HTTP response codes to indicate the success or failure of an API request. In general: Codes in the 2xx range indicate success. Codes in the 4xx range indicate an error that failed given the information provided (e.g., a required parameter was omitted, invalid input, etc.). Codes in the 5xx range indicate an error with the Appwrite server, but these are rare.\", \"   Code Text Description     200 OK Success!   201 Created The requested resource has been created successfully.   202 Accepted The requested change has been accepted for processing but has not been completed.   204 No Content The server has successfully fulfilled the request and that there is no additional content to send in the response payload body. This status will usually return on successful delete operations.   301 Moved Permanently The URL of the requested resource has been changed permanently. The new URL is given in the response.   304 Not Modified There was no new data to return.   400 Bad Request The request was invalid or cannot be otherwise served. An accompanying error message will explain further. Requests with wrong or invalid input will yield this response.   401 Unauthorized Missing or incorrect authentication credentials can happen when the API key or user permission is not sufficient.   403 Forbidden The request is understood, but it has been refused, or access is not allowed. An accompanying error message will explain why. Make sure to register your app in your project's dashboard platform list.   404 Not Found The URI requested is invalid or the resource requested, such as a user, does not exist.   409 Conflict This response is sent when a request conflicts with the current state of the server. This status code will usually appear when you're trying to create an already existing resource.   413 Payload Too Large This indicates that the request entity is larger than limits defined by server. This status code will usually appear happen when uploading a file or function that is too large   416 Invalid Range Invalid value in the range or content-range headers. Usually returned while uploading or downloading files using range header but the provided range value is not valid.   429 Too Many Requests Returned in when a request cannot be served due to the application's rate limit having been exhausted for the resource. See Rate Limits   500 Internal Server Error Something is broken. Contact our team, or raise a GitHub issue.   501 Not Implemented The feature is not implemented. Usually returned when the project owner has disabled an auth method or an entire service.   503 Service Unavailable The Appwrite servers are up but overloaded with requests. Try again later.   504 Gateway timeout The Appwrite servers are up, but the request couldn't be serviced due to some failure within the stack. Try again later.  \"]}, {\"level\": 2, \"title\": \"Error Messages\", \"body\": [\"When the Appwrite APIs return error messages, it does so in JSON format. For example, an error might look like this:\", \" {\\n    \\\"message\\\": \\\"Invalid id: Parameter must be a valid number\\\",\\n    \\\"type\\\": \\\"argument_invalid\\\",\\n    \\\"code\\\": 400\\n}\\n\"]}]", "metadata": {"source": "https://appwrite.io/docs/response-codes"}}