{"page_content": "[{\"level\": 1, \"title\": \" SDKs \", \"body\": [\"We provide libraries for major programming languages and platforms so you don't have to write code for interacting with our HTTP APIs from scratch.\", \"Our team is always working on improving and extending the current stack of available platforms and SDKs, listed below is a list of official libraries our team is currently maintaining.\", \"  Client SDKs   Server SDKs  \"]}, {\"level\": 2, \"title\": \"Client SDKs\", \"body\": [\"Client libraries for integrating with Appwrite to build client-based applications and websites. Read the getting started for web or getting started for Flutter tutorials to start building your first application.\", \"    Platform GitHub Repository           Web SDK  \\u00a011.0.0  appwrite/sdk-for-web    official         Flutter SDK  \\u00a09.0.0  appwrite/sdk-for-flutter    official         Apple SDK  \\u00a02.0.0  appwrite/sdk-for-apple    official         Android SDK  \\u00a02.0.0  appwrite/sdk-for-android    official    \"]}, {\"level\": 2, \"title\": \"Server SDKs\", \"body\": [\"Libraries for integrating with Appwrite to build server side integrations. Read the getting started for server tutorial to start building your first server integration.\", \"    Platform GitHub Repository           Node.js SDK  \\u00a09.0.0  appwrite/sdk-for-node    official         Deno SDK  \\u00a07.0.0  appwrite/sdk-for-deno    official         PHP SDK  \\u00a08.0.0  appwrite/sdk-for-php    official         Python SDK  \\u00a02.0.0  appwrite/sdk-for-python    official         Ruby SDK  \\u00a08.0.0  appwrite/sdk-for-ruby    official         .NET SDK  \\u00a00.4.0  appwrite/sdk-for-dotnet    official beta         Dart SDK  \\u00a08.0.0  appwrite/sdk-for-dart    official         Kotlin SDK  \\u00a02.0.0  appwrite/sdk-for-kotlin    official         Swift SDK  \\u00a02.0.0  appwrite/sdk-for-swift    official    \", \"If you would like to help us extend our platforms and SDKs stack, you are more than welcome to contact us or check out our Appwrite SDK Generator project GitHub repository and read our contribution guide.\"]}, {\"level\": 2, \"title\": \"Integrate without an SDK\", \"body\": [\"We are always looking to add new SDKs to our platform, but if the SDK you are looking for is still missing or in a beta channel, you can always integrate with Appwrite directly using any standard HTTP client and the Appwrite REST API. You can learn more about how you can integrate directly with Appwrite HTTP API from our dedicated blog post on the topic.\"]}]", "metadata": {"source": "https://appwrite.io/docs/sdks"}}